Tekla Open API Reference for Tekla Structures 2025
Arc.Equals Method
Overload List
Name | Description
Equals(Object)
 Checks for equality with another arc
 (Overrides Object.Equals(Object).)
Equals(ICurve)
 Checks for equality with another curve
Top
See Also
Reference
Arc Class
Tekla.Structures.Geometry3d Namespace